ProyectoBalanceadorDeCarga/BalanceoDockerSwarm/artillery/load-test_hard.yml
config:
  target: "http://192.168.50.30"  # IP del nodo manager
  phases:
    - duration: 30
      arrivalRate: 30   # 30 usuarios por segundo durante 60 segundos
      rampTo: 40 
      name: Warm up
    - duration: 60
      arrivalRate: 40   # 40 a 120 usuarios por segundo durante 60 segundos
      rampTo: 120
      name: Ramp up to peak load
    - duration: 90
      arrivalRate: 120   # 120 usuarios por segundo durante 60 segundos
      name: Peak load
scenarios:
  - flow:
      - get:
          url: "/"